; domain
(define (domain healthcare)

(:requirements :strips :typing :negative-preconditions :universal-preconditions)

(:types
	location
	unit - locatable
	content - locatable
	box - locatable
	patient - locatable
	robot-box - robot
	robot-patient - robot
	robot - locatable
)

(:constants 
	central_warehouse - location
	entrance - location
	scalpel tongue_depressor aspirin bandage thermometer - content
)

(:predicates
	(at ?x - locatable ?l - location)		; x is at location
	(at-unit ?p - patient ?u - unit) 		; patient is at unit

	(filled-with ?b - box ?c - content) 		; box is filled with content 
	(empty-box ?b - box)               			; box is empty
	
	(unit-has-content ?u - unit ?c - content) ; unit has specific content
	(unit-has-box ?u - unit ?b - box)              ; unit has a box
	
	(loaded ?r - robot ?b - box)          ; robot is carrying a box
	(unloaded ?r - robot-box)               	; robot is empty

	(with-patient ?r - robot ?p - patient)     ; robot is with a patient
	(busy ?r - robot-patient)               					; robot is busy with a patient

	(connected ?l1 - location ?l2 - location) ; locations are connected
)


; (:functions)

;define actions here
(:action fill
	:parameters (?r - robot-box ?b - box ?c - content ?l - location)
	:precondition (and 
		(at ?b ?l)
		(at ?r ?l)
		(at ?c ?l)
		(empty-box ?b)
	)
	:effect (and 
		(filled-with ?b ?c)
		(not (empty-box ?b))
	)
)

(:action empty
	:parameters (?r - robot-box ?b - box ?c - content ?u - unit ?l - location)
	:precondition (and 
		(at ?u ?l)
		(at ?b ?l)
		(at ?r ?l)
		(unit-has-box ?u ?b)
		(filled-with ?b ?c)
		(not (empty-box ?b))
		(not (unit-has-content ?u ?c))			; necessary?
	)
	:effect (and 
		(unit-has-content ?u ?c)
		(not (filled-with ?b ?c))
		(empty-box ?b)
		(at ?c ?l)
	)
)

(:action pick-up
	:parameters (?r - robot-box ?b - box ?l - location)
	:precondition (and 
		(at ?b ?l)
		(at ?r ?l)
		(unloaded ?r)
	)
	:effect (and 
		(loaded ?r ?b)
		(not (unloaded ?r))
		(not (at ?b ?l))
	)
)

(:action move
	:parameters (?r - robot ?from - location ?to - location)
	:precondition (and 
		(at ?r ?from)
		(or (connected ?from ?to) (connected ?to ?from))
	)
	:effect (and 
		(at ?r ?to)
		(not (at ?r ?from))

		(forall (?b - box) 
			(when (loaded ?r ?b) 
				(and (at ?b ?to)
					(not (at ?b ?from))
				)
			)
		)

		(forall (?p - patient) 
			(when (with-patient ?r ?p) 
				(and (at ?p ?to)
					(not (at ?p ?from))
				)
			)
		)
	)
)

(:action deliver
		:parameters (?r - robot-box ?b - box ?l - location ?u - unit)
		:precondition (and
			(at ?r ?l)
			(at ?u ?l)
			(at ?b ?l)

			(loaded ?r ?b)
		)
		:effect (and 
			(unit-has-box ?u ?b)
			(not (loaded ?r ?b))
			(unloaded ?r)
		)
)

(:action take-patient
	:parameters (?r - robot-patient ?p - patient ?l - location)
	:precondition (and 
		(at ?r ?l)
		(at ?p ?l)
		(not (busy ?r))
	)
	:effect (and 
		(with-patient ?r ?p)
		(busy ?r)
	)
)


(:action release-patient
	:parameters (?r - robot-patient ?p - patient ?l - location ?u - unit)
	:precondition (and 
		(at ?r ?l)
		(at ?p ?l)
		(at ?u ?l)
		(with-patient ?r ?p)
		(busy ?r)
	)

	:effect (and 
		(not (with-patient ?r ?p))
		(not (busy ?r))
		(at-unit ?p ?u)
	)
)
)

; problem
(define (problem problem1) (:domain healthcare)
(:objects 
    r1 - robot-box
    r2 - robot-patient
    
    b1 b2 b3 - box

    u1 u2 u3 - unit
    l1 l2 l3 u4 - location

    p1 p2 - patient
)

(:init
    (at b1 central_warehouse)
    (at b2 central_warehouse)
    (at b3 central_warehouse)

    (empty-box b1)
    (empty-box b2)
    (empty-box b3)

    (at scalpel central_warehouse)
    (at tongue_depressor central_warehouse)
    (at aspirin central_warehouse)
    (at bandage central_warehouse)
    (at thermometer central_warehouse)

    (at u1 l1)
    (at u2 l2)
    (at u3 l3)
    (at u4 l3)

    (at r1 central_warehouse)
    (at r2 entrance)

    (unloaded r1)

    (at p1 entrance)
    (at p2 entrance)
    
    (connected central_warehouse entrance)
    (connected entrance l1)
    (connected entrance l2)
    (connected entrance l3)
    (connected central_warehouse l1)
    (connected central_warehouse l2)
    (connected central_warehouse l3)
)

(:goal (and

    (unit-has-content u1 scalpel)
    (unit-has-content u1 bandage)
    (unit-has-content u2 thermometer)

    (at-unit p1 u1)
    (at-unit p2 u2)
))

)

; plan
1. (take-patient r2 p1 entrance)
   added: (with-patient r2 p1) (busy r2)
   goals met: 0 of 5
2. (move r2 entrance l1)
   deleted: (at r2 entrance) (at p1 entrance)
   added: (at r2 l1) (at p1 l1)
   goals met: 0 of 5
3. (release-patient r2 p1 l1 u1)
   deleted: (with-patient r2 p1) (busy r2)
   added: (at-unit p1 u1)
   goals met: 1 of 5
4. (move r2 l1 entrance)
   deleted: (at r2 l1)
   added: (at r2 entrance)
   goals met: 1 of 5
5. (take-patient r2 p2 entrance)
   added: (with-patient r2 p2) (busy r2)
   goals met: 1 of 5
6. (move r2 entrance l2)
   deleted: (at r2 entrance) (at p2 entrance)
   added: (at r2 l2) (at p2 l2)
   goals met: 1 of 5
7. (release-patient r2 p2 l2 u2)
   deleted: (with-patient r2 p2) (busy r2)
   added: (at-unit p2 u2)
   goals met: 2 of 5
8. (pick-up r1 b3 central_warehouse)
   deleted: (unloaded r1) (at b3 central_warehouse)
   added: (loaded r1 b3)
   goals met: 2 of 5
9. (move r1 central_warehouse l1)
   deleted: (at r1 central_warehouse)
   added: (at r1 l1) (at b3 l1)
   goals met: 2 of 5
10. (move r1 l1 central_warehouse)
   deleted: (at r1 l1) (at b3 l1)
   added: (at r1 central_warehouse) (at b3 central_warehouse)
   goals met: 2 of 5
11. (fill r1 b3 bandage central_warehouse)
   deleted: (empty-box b3)
   added: (filled-with b3 bandage)
   goals met: 2 of 5
12. (move r1 central_warehouse l1)
   deleted: (at r1 central_warehouse) (at b3 central_warehouse)
   added: (at r1 l1) (at b3 l1)
   goals met: 2 of 5
13. (deliver r1 b3 l1 u1)
   deleted: (loaded r1 b3)
   added: (unit-has-box u1 b3) (unloaded r1)
   goals met: 2 of 5
14. (empty r1 b3 bandage u1 l1)
   deleted: (filled-with b3 bandage)
   added: (unit-has-content u1 bandage) (empty-box b3) (at bandage l1)
   goals met: 3 of 5
15. (pick-up r1 b3 l1)
   deleted: (unloaded r1) (at b3 l1)
   added: (loaded r1 b3)
   goals met: 3 of 5
16. (move r1 l1 central_warehouse)
   deleted: (at r1 l1)
   added: (at r1 central_warehouse) (at b3 central_warehouse)
   goals met: 3 of 5
17. (fill r1 b3 scalpel central_warehouse)
   deleted: (empty-box b3)
   added: (filled-with b3 scalpel)
   goals met: 3 of 5
18. (move r1 central_warehouse l1)
   deleted: (at r1 central_warehouse) (at b3 central_warehouse)
   added: (at r1 l1) (at b3 l1)
   goals met: 3 of 5
19. (empty r1 b3 scalpel u1 l1)
   deleted: (filled-with b3 scalpel)
   added: (unit-has-content u1 scalpel) (empty-box b3) (at scalpel l1)
   goals met: 4 of 5
20. (move r1 l1 central_warehouse)
   deleted: (at r1 l1) (at b3 l1)
   added: (at r1 central_warehouse) (at b3 central_warehouse)
   goals met: 4 of 5
21. (fill r1 b3 thermometer central_warehouse)
   deleted: (empty-box b3)
   added: (filled-with b3 thermometer)
   goals met: 4 of 5
22. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse) (at b3 central_warehouse)
   added: (at r1 l2) (at b3 l2)
   goals met: 4 of 5
23. (deliver r1 b3 l2 u2)
   deleted: (loaded r1 b3)
   added: (unit-has-box u2 b3) (unloaded r1)
   goals met: 4 of 5
24. (empty r1 b3 thermometer u2 l2)
   deleted: (filled-with b3 thermometer)
   added: (unit-has-content u2 thermometer) (empty-box b3) (at thermometer l2)
   goals met: 5 of 5
